Documents/СторнированиеСтрокиЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>СторнированиеСтрокиЗаказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЗакупку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьЗаЕдиницу</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/УпаковкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>УпаковкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СторнированиеСтрокиЗаказа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДанныеСтроки") Тогда
		
		Данные = Параметры.ДанныеСтроки;
		
		Объект.Дата 				= ТекущаяДата();
		Объект.Заказ				= Данные.Заказ;
		Объект.Номенклатура 		= Данные.Номенклатура;
		Объект.Партия				= Данные.Партия;
		Объект.Упаковка				= Данные.Упаковка;
		Объект.КоличествоУпаковок   = Данные.КоличествоУпаковок;
		Объект.ЕдиницаИзмерения		= Данные.ЕдиницаИзмерения;
		Объект.Количество			= Данные.Количество;
		Объект.СтоимостьЗаЕдиницу	= Данные.СтоимостьЗаЕдиницу;
		Объект.Сумма				= Данные.Сумма;
		
	КонецЕсли;
	//ТарураевЕ { 1.0.4 # 13.03.2023

	Если Объект.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.БезУпаковки") Тогда
		Элементы.КоличествоУпаковок.Доступность = Ложь;
		Элементы.Количество.Доступность = Истина;
	Иначе
		Элементы.Количество.Доступность = Ложь;
		Элементы.КоличествоУпаковок.Доступность = Истина;
	КонецЕсли;
	//ТарураевЕ } 1.0.4 # 13.03.2023

КонецПроцедуры

&НаКлиенте
Процедура Сторнировать(Команда)
	 ЭтотОбъект.Записать();	//ТарураевЕ { 1.0.4 # 13.03.2023

	 РаботаСДокументами.СторнироватьСтрокуЗаказа(Объект.Ссылка, Объект.Заказ, Объект.Номенклатура);

	 ЭтотОбъект.Закрыть();	//ТарураевЕ  1.0.4 # 13.03.2023
КонецПроцедуры

//ТарураевЕ { 1.0.4 # 13.03.2023
&НаКлиенте
Процедура СтоимостьЗаЕдиницуПриИзменении(Элемент)
	Объект.Сумма = Объект.СтоимостьЗаЕдиницу * Объект.КоличествоУпаковок;	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	Объект.СтоимостьЗаЕдиницу = Объект.Сумма / Объект.КоличествоУпаковок;
КонецПроцедуры
 &НаКлиенте
Процедура ВыполнитьПересчет()

	
	Если Объект.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиНоменклатуры.БезУпаковки") Тогда    	
		Объект.КоличествоУпаковок = Объект.Количество;                                                      	
	Иначе                                                                                                   	
		КратностьУпаковки = ОбщегоНазначенияСервер.ЗначениеРеквизита(Объект.Упаковка, "Кратность");
		Объект.Количество = Объект.КоличествоУпаковок * КратностьУпаковки;	                                	
	КонецЕсли;

КонецПроцедуры // ВыполнитьПересчёт(
&НаКлиенте
Процедура КоличествоУпаковокПриИзменении(Элемент)
	Объект.Сумма = Объект.СтоимостьЗаЕдиницу * Объект.КоличествоУпаковок;	
	ВыполнитьПересчет();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)   //тар
	Объект.КоличествоУпаковок = Объект.Количество;
	Объект.Сумма = Объект.СтоимостьЗаЕдиницу * Объект.КоличествоУпаковок;	
КонецПроцедуры
//ТарураевЕ } 1.0.4 # 13.03.2023
